In [3]:
# import library
import sqlite3

In [4]:
# connect a database
db=sqlite3.connect("student.db")

In [5]:
cursor=db.cursor()    # cursor

In [8]:
cursor.execute("CREATE TABLE student_data2(roll_no INT PRIMARY KEY, name TEXT, total_marks INT, rank INT)")

In [9]:
# insert data in table 
cursor.execute("INSERT INTO student_data2(roll_no,name,total_marks,rank) values(21, 'rohit',400,15),(2,'ajay',350,20),(3,'aakash',420,12),(4,'akash',410,13),(5,'sahil',440,8),(6,'vipul',340,21),(7,'nikhil',400,15),(8,'abhishek',450,7),(9,'ekta',408,14),(10,'sachin',460,5),(11,'simran',330,22),(12,'nancy',400,15),(13,'ayushi',330,22),(14,'mohit',480,2),(15,'rahul',485,1),(16,'deepika',250,27),(17,'deepak',290,24),(18,'mohit',395,16),(19,'abhisheek',288,24),(20,'navdeep',435,9)")

In [6]:
#save data
db.commit()

In [7]:
cursor.rowcount,"rows inserted"

(20, 'rows inserted')

# select

In [9]:
cursor.execute("SELECT * FROM student_data")

In [10]:
# fetch all
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'ajay', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

In [11]:
x=cursor.execute("SELECT roll_no from student_data")
for y in x:
    print(y)

(2,)
(3,)
(4,)
(5,)
(6,)
(7,)
(8,)
(9,)
(10,)
(11,)
(12,)
(13,)
(14,)
(15,)
(16,)
(17,)
(18,)
(19,)
(20,)
(21,)

In [12]:
cursor.execute("SELECT roll_no from student_data")
roll_no=cursor.fetchall()
print(roll_no)

[(2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,), (11,), (12,), (13,), (14,), (15,), (16,), (17,), (18,), (19,), (20,), (21,)]

In [13]:
# fetch all names
names=cursor.execute("SELECT name from student_data")
for x in names:
    print(x)

('rohit',)
('ajay',)
('aakash',)
('akash',)
('sahil',)
('vipul',)
('nikhil',)
('abhishek',)
('ekta',)
('sachin',)
('simran',)
('nancy',)
('ayushi',)
('mohit',)
('rahul',)
('deepika',)
('deepak',)
('mohit',)
('abhisheek',)
('navdeep',)

In [15]:
cursor.execute("SELECT name from student_data")
names=cursor.fetchall()[:11]
print(names)

[('rohit',), ('ajay',), ('aakash',), ('akash',), ('sahil',), ('vipul',), ('nikhil',), ('abhishek',), ('ekta',), ('sachin',), ('simran',)]

# show all tables

In [16]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")
tables = cursor.fetchall()
tables

[('student_data',)]

# show column present in tables

In [17]:
cursor.execute("PRAGMA table_info(student_data);")
cursor.fetchall()

[(0, 'roll_no', 'INT', 0, None, 1),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'total_marks', 'INT', 0, None, 0),
 (3, 'rank', 'INT', 0, None, 0)]

0 → This is the first column in the table. 

name: 'roll_no' → The column is named roll_no.

type: 'INT' → The data type of this column is INT (integer).

notnull: 0 → This column does not have a NOT NULL constraint. 

dflt_value: None → There is no default value defined for this column.

pk: 1 → This column is the primary key of the table.

In [19]:
cursor.execute("PRAGMA table_info(student_data)")
y=cursor.fetchall()
for column in y:
    print(column[1])

roll_no
name
total_marks
rank

# display specific columns

In [20]:
cursor.execute("SELECT name,rank from student_data")
cursor.fetchall()

[('rohit', 15),
 ('ajay', 20),
 ('aakash', 12),
 ('akash', 13),
 ('sahil', 8),
 ('vipul', 21),
 ('nikhil', 15),
 ('abhishek', 7),
 ('ekta', 14),
 ('sachin', 5),
 ('simran', 22),
 ('nancy', 15),
 ('ayushi', 22),
 ('mohit', 2),
 ('rahul', 1),
 ('deepika', 27),
 ('deepak', 24),
 ('mohit', 16),
 ('abhisheek', 24),
 ('navdeep', 9)]

In [21]:
cursor.execute("SELECT name,rank from student_data")
x=cursor.fetchall()
for names in x[:5]:
    print(names)

('rohit', 15)
('ajay', 20)
('aakash', 12)
('akash', 13)
('sahil', 8)

In [11]:
cursor.execute("SELECT name,rank from student_data1")
x=cursor.fetchall()
for names in x:
    print(f"name: {names[0]},    rank: {names[1]}")

name: rohit,    rank: 15
name: ajay,    rank: 20
name: aakash,    rank: 12
name: akash,    rank: 13
name: sahil,    rank: 8
name: vipul,    rank: 21
name: nikhil,    rank: 15
name: abhishek,    rank: 7
name: ekta,    rank: 14
name: sachin,    rank: 5
name: simran,    rank: 22
name: nancy,    rank: 15
name: ayushi,    rank: 22
name: mohit,    rank: 2
name: rahul,    rank: 1
name: deepika,    rank: 27
name: deepak,    rank: 24
name: mohit,    rank: 16
name: abhisheek,    rank: 24
name: navdeep,    rank: 9

# sorting the data

In [29]:
cursor.execute("SELECT * from student_data ORDER BY rank ASC")
cursor.fetchall()[:5]

[(15, 'rahul', 485, 1),
 (14, 'mohit', 480, 2),
 (10, 'sachin', 460, 5),
 (8, 'abhishek', 450, 7),
 (5, 'sahil', 440, 8)]

In [30]:
cursor.execute("SELECT * from student_data ORDER BY rank DESC")
cursor.fetchall()

[(16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (19, 'abhisheek', 288, 24),
 (11, 'simran', 330, 22),
 (13, 'ayushi', 330, 22),
 (6, 'vipul', 340, 21),
 (2, 'ajay', 350, 20),
 (18, 'mohit', 395, 16),
 (21, 'rohit', 400, 15),
 (7, 'nikhil', 400, 15),
 (12, 'nancy', 400, 15),
 (9, 'ekta', 408, 14),
 (4, 'akash', 410, 13),
 (3, 'aakash', 420, 12),
 (20, 'navdeep', 435, 9),
 (5, 'sahil', 440, 8),
 (8, 'abhishek', 450, 7),
 (10, 'sachin', 460, 5),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1)]

In [31]:
cursor.execute("SELECT name,total_marks from student_data ORDER BY name ASC")
cursor.fetchall()

[('aakash', 420),
 ('abhisheek', 288),
 ('abhishek', 450),
 ('ajay', 350),
 ('akash', 410),
 ('ayushi', 330),
 ('deepak', 290),
 ('deepika', 250),
 ('ekta', 408),
 ('mohit', 480),
 ('mohit', 395),
 ('nancy', 400),
 ('navdeep', 435),
 ('nikhil', 400),
 ('rahul', 485),
 ('rohit', 400),
 ('sachin', 460),
 ('sahil', 440),
 ('simran', 330),
 ('vipul', 340)]

# where method

In [33]:
cursor.execute("SELECT * from student_data where name='sunny'")
cursor.fetchall()

[]

In [35]:
cursor.execute("SELECT * from student_data where rank Between 1 and 5")
cursor.fetchall()

[(10, 'sachin', 460, 5), (14, 'mohit', 480, 2), (15, 'rahul', 485, 1)]

In [36]:
cursor.execute("SELECT * from student_data where rank >10")
cursor.fetchall()[1]

(2, 'ajay', 350, 20)

In [12]:
cursor.execute("SELECT name,rank from student_data where name='rahul'")
cursor.fetchall()

[('rahul', 1)]

In [13]:
cursor.execute("SELECT * from student_data where rank >5 and rank<15")
cursor.fetchall()

[(3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (20, 'navdeep', 435, 9)]

In [14]:
cursor.execute("SELECT * from student_data where name IN ('sahil','rahul','ajay')")
cursor.fetchall()

[(2, 'ajay', 350, 20), (5, 'sahil', 440, 8), (15, 'rahul', 485, 1)]

In [16]:
cursor.execute("SELECT * FROM student_data WHERE name NOT IN ('rahul', 'ajay','vipul')")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

In [ ]:
# like operator 
#  % - you can select the record that start ,including or end with a given letter or phrase.. use % to represent wildcard

In [18]:
x=cursor.execute("SELECT * from student_data where name LIKE '%l%'")
for a in x:
    print(a)

(5, 'sahil', 440, 8)
(6, 'vipul', 340, 21)
(7, 'nikhil', 400, 15)
(15, 'rahul', 485, 1)

In [19]:
# name starting with 's'
x=cursor.execute("SELECT * from student_data where name LIKE 's%'")
for a in x:
    print(a)

(5, 'sahil', 440, 8)
(10, 'sachin', 460, 5)
(11, 'simran', 330, 22)

In [20]:
# name starting with 's' and ending with 'l'
x=cursor.execute("SELECT * from student_data where name LIKE 's%l'")
for a in x:
    print(a)

(5, 'sahil', 440, 8)

In [21]:
# find data where name 2nd alphabet is 'a' and have 1 aplhabet before it 
x=cursor.execute("SELECT * from student_data where name LIKE '_a%'")
for a in x:
    print(a)

(3, 'aakash', 420, 12)
(5, 'sahil', 440, 8)
(10, 'sachin', 460, 5)
(12, 'nancy', 400, 15)
(15, 'rahul', 485, 1)
(20, 'navdeep', 435, 9)

In [22]:
x=cursor.execute("SELECT * from student_data where name LIKE '__a%'")
for a in x:
    print(a)

(2, 'ajay', 350, 20)
(4, 'akash', 410, 13)

In [23]:
x=cursor.execute("SELECT * from student_data1 where name LIKE '__n%'")
for a in x:
    print(a)

(12, 'nancy', 400, 15)

In [24]:
x=cursor.execute("SELECT * from student_data where name LIKE '__n__'")
for a in x:
    print(a)

(12, 'nancy', 400, 15)

In [25]:
cursor.execute("SELECT * FROM student_data where total_marks > 400 OR rank < 10")
cursor.fetchall()

[(3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (20, 'navdeep', 435, 9)]

In [26]:
cursor.execute("SELECT * FROM student_data WHERE total_marks > 400 AND rank < 10")
cursor.fetchall()

[(5, 'sahil', 440, 8),
 (8, 'abhishek', 450, 7),
 (10, 'sachin', 460, 5),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (20, 'navdeep', 435, 9)]

In [27]:
# check null values
cursor.execute("SELECT * FROM student_data WHERE rank IS NULL")
cursor.fetchall()

[]

In [28]:
cursor.execute("SELECT * FROM student_data WHERE rank IS NOT NULL;")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'ajay', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 8),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

# subqueries

In [30]:
cursor.execute("SELECT * FROM student_data WHERE rank = (SELECT MIN(rank) FROM student_data)")
cursor.fetchall()

[(15, 'rahul', 485, 1)]

In [34]:
cursor.execute("SELECT * FROM student_data WHERE rank = (SELECT MAX(rank) FROM student_data)")
cursor.fetchall()

[(16, 'deepika', 250, 27)]

In [35]:
cursor.execute("SELECT * FROM student_data WHERE total_marks = (SELECT MIN(total_marks) FROM student_data)")
cursor.fetchall()

[(16, 'deepika', 250, 27)]

In [36]:
cursor.execute("SELECT MAX(rank) FROM student_data")
cursor.fetchall()

[(27,)]

# Update Data

In [37]:
# change sahil rank to 10
cursor.execute("UPDATE student_data SET rank=10 where name='sahil'")
db.commit()

In [38]:
cursor.execute("SELECT * from student_data")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'ajay', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 10),
 (6, 'vipul', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

In [40]:
# change name from 'vipul' to sunny
cursor.execute("UPDATE student_data SET name='sunny' where name='vipul'")
cursor.execute("SELECT name from student_data")
cursor.fetchall()

[('rohit',),
 ('sunny',),
 ('aakash',),
 ('akash',),
 ('sahil',),
 ('sunny',),
 ('nikhil',),
 ('abhishek',),
 ('ekta',),
 ('sachin',),
 ('simran',),
 ('nancy',),
 ('ayushi',),
 ('mohit',),
 ('rahul',),
 ('deepika',),
 ('deepak',),
 ('mohit',),
 ('abhisheek',),
 ('navdeep',)]

# order by method

In [41]:
cursor.execute("SELECT * FROM student_data ORDER BY name")
cursor.fetchall()

[(3, 'aakash', 420, 12),
 (19, 'abhisheek', 288, 24),
 (8, 'abhishek', 450, 7),
 (4, 'akash', 410, 13),
 (13, 'ayushi', 330, 22),
 (17, 'deepak', 290, 24),
 (16, 'deepika', 250, 27),
 (9, 'ekta', 408, 14),
 (14, 'mohit', 480, 2),
 (18, 'mohit', 395, 16),
 (12, 'nancy', 400, 15),
 (20, 'navdeep', 435, 9),
 (7, 'nikhil', 400, 15),
 (15, 'rahul', 485, 1),
 (21, 'rohit', 400, 15),
 (10, 'sachin', 460, 5),
 (5, 'sahil', 440, 10),
 (11, 'simran', 330, 22),
 (2, 'sunny', 350, 20),
 (6, 'sunny', 340, 21)]

In [42]:
cursor.execute("select * FROM student_data ORDER BY roll_no desc")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (20, 'navdeep', 435, 9),
 (19, 'abhisheek', 288, 24),
 (18, 'mohit', 395, 16),
 (17, 'deepak', 290, 24),
 (16, 'deepika', 250, 27),
 (15, 'rahul', 485, 1),
 (14, 'mohit', 480, 2),
 (13, 'ayushi', 330, 22),
 (12, 'nancy', 400, 15),
 (11, 'simran', 330, 22),
 (10, 'sachin', 460, 5),
 (9, 'ekta', 408, 14),
 (8, 'abhishek', 450, 7),
 (7, 'nikhil', 400, 15),
 (6, 'sunny', 340, 21),
 (5, 'sahil', 440, 10),
 (4, 'akash', 410, 13),
 (3, 'aakash', 420, 12),
 (2, 'sunny', 350, 20)]

In [43]:
cursor.execute("select * FROM student_data ORDER BY roll_no asc")
cursor.fetchall()

[(2, 'sunny', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 10),
 (6, 'sunny', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (16, 'deepika', 250, 27),
 (17, 'deepak', 290, 24),
 (18, 'mohit', 395, 16),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9),
 (21, 'rohit', 400, 15)]

# delete data

In [48]:
cursor.execute("DELETE FROM student_data WHERE roll_no=18")
db.commit()

In [49]:
cursor.rowcount

1

In [50]:
cursor.execute("SELECT * FROM student_data")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'sunny', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 10),
 (6, 'sunny', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (15, 'rahul', 485, 1),
 (17, 'deepak', 290, 24),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

In [51]:
cursor.execute("DELETE FROM student_data WHERE total_marks>480 ")
cursor.execute("SELECT * FROM student_data")
cursor.fetchall()

[(21, 'rohit', 400, 15),
 (2, 'sunny', 350, 20),
 (3, 'aakash', 420, 12),
 (4, 'akash', 410, 13),
 (5, 'sahil', 440, 10),
 (6, 'sunny', 340, 21),
 (7, 'nikhil', 400, 15),
 (8, 'abhishek', 450, 7),
 (9, 'ekta', 408, 14),
 (10, 'sachin', 460, 5),
 (11, 'simran', 330, 22),
 (12, 'nancy', 400, 15),
 (13, 'ayushi', 330, 22),
 (14, 'mohit', 480, 2),
 (17, 'deepak', 290, 24),
 (19, 'abhisheek', 288, 24),
 (20, 'navdeep', 435, 9)]

# Add a New Column to the Table

In [16]:
cursor.execute("ALTER TABLE student_data2 ADD COLUMN class_section TEXT")

In [17]:
# 1) Update a Specific Row: To update the class_section for a specific row:

cursor.execute("UPDATE student_data2 SET class_section = 'A' WHERE roll_no = 1")

In [18]:
# 2) update multiple rows
cursor.execute("UPDATE student_data2 SET class_section =CASE WHEN roll_no = 1 THEN 'A' WHEN roll_no = 2 THEN 'B' WHEN roll_no = 3 THEN 'C' END WHERE roll_no IN (1, 2, 3)")

In [19]:
cursor.execute("SELECT * FROM student_data2")
cursor.fetchall()

[(21, 'rohit', 400, 15, None),
 (2, 'ajay', 350, 20, 'B'),
 (3, 'aakash', 420, 12, 'C'),
 (4, 'akash', 410, 13, None),
 (5, 'sahil', 440, 8, None),
 (6, 'vipul', 340, 21, None),
 (7, 'nikhil', 400, 15, None),
 (8, 'abhishek', 450, 7, None),
 (9, 'ekta', 408, 14, None),
 (10, 'sachin', 460, 5, None),
 (11, 'simran', 330, 22, None),
 (12, 'nancy', 400, 15, None),
 (13, 'ayushi', 330, 22, None),
 (14, 'mohit', 480, 2, None),
 (15, 'rahul', 485, 1, None),
 (16, 'deepika', 250, 27, None),
 (17, 'deepak', 290, 24, None),
 (18, 'mohit', 395, 16, None),
 (19, 'abhisheek', 288, 24, None),
 (20, 'navdeep', 435, 9, None)]

In [21]:
# 3) update all rows with same values
cursor.execute("UPDATE student_data2 SET class_section = 'A'")

In [22]:
cursor.execute("SELECT * FROM student_data2")
cursor.fetchall()

[(21, 'rohit', 400, 15, 'A'),
 (2, 'ajay', 350, 20, 'A'),
 (3, 'aakash', 420, 12, 'A'),
 (4, 'akash', 410, 13, 'A'),
 (5, 'sahil', 440, 8, 'A'),
 (6, 'vipul', 340, 21, 'A'),
 (7, 'nikhil', 400, 15, 'A'),
 (8, 'abhishek', 450, 7, 'A'),
 (9, 'ekta', 408, 14, 'A'),
 (10, 'sachin', 460, 5, 'A'),
 (11, 'simran', 330, 22, 'A'),
 (12, 'nancy', 400, 15, 'A'),
 (13, 'ayushi', 330, 22, 'A'),
 (14, 'mohit', 480, 2, 'A'),
 (15, 'rahul', 485, 1, 'A'),
 (16, 'deepika', 250, 27, 'A'),
 (17, 'deepak', 290, 24, 'A'),
 (18, 'mohit', 395, 16, 'A'),
 (19, 'abhisheek', 288, 24, 'A'),
 (20, 'navdeep', 435, 9, 'A')]

In [23]:
# 4)condition based updating
cursor.execute("UPDATE student_data2 SET class_section = 'B' WHERE total_marks > 400")
cursor.execute("SELECT * FROM student_data2")
cursor.fetchall()

[(21, 'rohit', 400, 15, 'A'),
 (2, 'ajay', 350, 20, 'A'),
 (3, 'aakash', 420, 12, 'B'),
 (4, 'akash', 410, 13, 'B'),
 (5, 'sahil', 440, 8, 'B'),
 (6, 'vipul', 340, 21, 'A'),
 (7, 'nikhil', 400, 15, 'A'),
 (8, 'abhishek', 450, 7, 'B'),
 (9, 'ekta', 408, 14, 'B'),
 (10, 'sachin', 460, 5, 'B'),
 (11, 'simran', 330, 22, 'A'),
 (12, 'nancy', 400, 15, 'A'),
 (13, 'ayushi', 330, 22, 'A'),
 (14, 'mohit', 480, 2, 'B'),
 (15, 'rahul', 485, 1, 'B'),
 (16, 'deepika', 250, 27, 'A'),
 (17, 'deepak', 290, 24, 'A'),
 (18, 'mohit', 395, 16, 'A'),
 (19, 'abhisheek', 288, 24, 'A'),
 (20, 'navdeep', 435, 9, 'B')]

# insert more data

In [62]:
cursor.execute("INSERT INTO student_data(roll_no,name,total_marks,rank,class_section) values(28,'mansi',490,2,'A')")

In [63]:
cursor.execute("SELECT * FROM student_data")
cursor.fetchall()

[(21, 'rohit', 400, 15, 'A'),
 (2, 'sunny', 350, 20, 'A'),
 (3, 'aakash', 420, 12, 'B'),
 (4, 'akash', 410, 13, 'B'),
 (5, 'sahil', 440, 10, 'B'),
 (6, 'sunny', 340, 21, 'A'),
 (7, 'nikhil', 400, 15, 'A'),
 (8, 'abhishek', 450, 7, 'B'),
 (9, 'ekta', 408, 14, 'B'),
 (10, 'sachin', 460, 5, 'B'),
 (11, 'simran', 330, 22, 'A'),
 (12, 'nancy', 400, 15, 'A'),
 (13, 'ayushi', 330, 22, 'A'),
 (14, 'mohit', 480, 2, 'B'),
 (17, 'deepak', 290, 24, 'A'),
 (19, 'abhisheek', 288, 24, 'A'),
 (20, 'navdeep', 435, 9, 'B'),
 (26, 'sachinn', 490, 2, 'A'),
 (28, 'mansi', 490, 2, 'A')]

# count total entries

In [64]:
cursor.execute("SELECT count(*) from student_data")

In [65]:
cursor.fetchall()

[(19,)]

# aggregate functions
1.COUNT

2.SUM

3.AVERAGE (AVG))

4.MAXIMUM (MAX())

5.MINIMUM (MIN())

6.VARIANCE

7.STANDARD DEVIATION (STDDEV)

8.MEDIAN

## count

In [11]:
cursor.execute("select count(*) from student_data2")  #  Total number of rows
cursor.fetchall()

[(20,)]

In [12]:
cursor.execute("SELECT COUNT(name) FROM student_data2")  # Total number of non-NULL names
cursor.fetchall()

[(20,)]

In [13]:
cursor.execute("SELECT COUNT(DISTINCT rank) FROM student_data2")  # count of unique ranks
cursor.fetchall()

[(16,)]

## Sum

In [14]:
cursor.execute("SELECT SUM(total_marks) from student_data2")
cursor.fetchall()

[(7761,)]

In [24]:
cursor.execute("SELECT SUM(total_marks) from student_data2 WHERE class_section = 'A'")
cursor.fetchall()

[(3773,)]

## AVERAGE

In [25]:
cursor.execute("SELECT AVG(total_marks) from student_data2")
cursor.fetchall()

[(388.05,)]

In [26]:
cursor.execute("SELECT AVG(total_marks) from student_data2 WHERE class_section = 'A'")
cursor.fetchall()

[(343.0,)]

# group by

## group by column name

In [27]:
# Group students by rank and count the number of students in each rank
cursor.execute("SELECT rank,COUNT(*) from student_data2 GROUP BY rank")

In [28]:
cursor.fetchall()

[(1, 1),
 (2, 1),
 (5, 1),
 (7, 1),
 (8, 1),
 (9, 1),
 (12, 1),
 (13, 1),
 (14, 1),
 (15, 3),
 (16, 1),
 (20, 1),
 (21, 1),
 (22, 2),
 (24, 2),
 (27, 1)]

In [29]:
cursor.execute("SELECT class_section,COUNT(*) FROM student_data2 GROUP BY class_section")
cursor.fetchall()

[('A', 11), ('B', 9)]

## group by multiple columns

In [31]:
cursor.execute("SELECT class_section,rank,count(*) FROM student_data2 GROUP BY class_section")
cursor.fetchall()

[('A', 15, 11), ('B', 12, 9)]

In [32]:
cursor.execute("SELECT class_section,rank,count(*) FROM student_data2 GROUP BY class_section,rank")
cursor.fetchall()

[('A', 15, 3),
 ('A', 16, 1),
 ('A', 20, 1),
 ('A', 21, 1),
 ('A', 22, 2),
 ('A', 24, 2),
 ('A', 27, 1),
 ('B', 1, 1),
 ('B', 2, 1),
 ('B', 5, 1),
 ('B', 7, 1),
 ('B', 8, 1),
 ('B', 9, 1),
 ('B', 12, 1),
 ('B', 13, 1),
 ('B', 14, 1)]

## using aggregate function in group by clause

In [35]:
cursor.execute("SELECT class_section, AVG(total_marks) as avg_marks FROM student_data2 GROUP BY class_section,rank")
cursor.fetchall()

[('A', 400.0),
 ('A', 395.0),
 ('A', 350.0),
 ('A', 340.0),
 ('A', 330.0),
 ('A', 289.0),
 ('A', 250.0),
 ('B', 485.0),
 ('B', 480.0),
 ('B', 460.0),
 ('B', 450.0),
 ('B', 440.0),
 ('B', 435.0),
 ('B', 420.0),
 ('B', 410.0),
 ('B', 408.0)]

In [36]:
cursor.execute("SELECT class_section, AVG(total_marks) as avg_marks FROM student_data2 GROUP BY class_section")
cursor.fetchall()

[('A', 343.0), ('B', 443.1111111111111)]

## group by with order by

In [37]:
cursor.execute("SELECT class_section,SUM(total_marks) AS total_marks FROM student_data2 GROUP BY class_section ORDER BY total_marks DESC")
cursor.fetchall()

[('B', 3988), ('A', 3773)]

In [38]:
cursor.execute("SELECT class_section,SUM(total_marks) AS total_marks FROM student_data2 GROUP BY class_section ORDER BY total_marks ASC")
cursor.fetchall()

[('A', 3773), ('B', 3988)]

In [39]:
cursor.execute("SELECT class_section,rank,SUM(total_marks) AS total_marks FROM student_data2 GROUP BY class_section,rank ORDER BY total_marks DESC")
cursor.fetchall()

[('A', 15, 1200),
 ('A', 22, 660),
 ('A', 24, 578),
 ('B', 1, 485),
 ('B', 2, 480),
 ('B', 5, 460),
 ('B', 7, 450),
 ('B', 8, 440),
 ('B', 9, 435),
 ('B', 12, 420),
 ('B', 13, 410),
 ('B', 14, 408),
 ('A', 16, 395),
 ('A', 20, 350),
 ('A', 21, 340),
 ('A', 27, 250)]

## group by with subqueries

In [41]:
cursor.execute("SELECT class_section,MAX(total_marks) AS highest_marks FROM (SELECT * FROM student_data2 WHERE rank <= 10) AS top_Students GROUP BY class_section")
cursor.fetchall()

[('B', 485)]

# Limit the Output

In [42]:
# retrive top five
cursor.execute("SELECT * FROM student_data2 ORDER BY total_marks DESC LIMIT 5")
cursor.fetchall()

[(15, 'rahul', 485, 1, 'B'),
 (14, 'mohit', 480, 2, 'B'),
 (10, 'sachin', 460, 5, 'B'),
 (8, 'abhishek', 450, 7, 'B'),
 (5, 'sahil', 440, 8, 'B')]